# Домашнее задание к занятию «Новшества С++»

Выполнив это задание, вы научитесь использовать некоторые возможности современного C++ в своих программах.

### Цель задания

1. Научиться работать с лямбда-функциями.
2. Научиться работать с std::variant.

### Подготовка к выполнению домашнего задания

1. Для выполнения задания и прохождения курса нужен компьютер с операционной системой Windows или macOS и установленной на нём Microsoft Visual Studio 2022, готовой для разработки консольных программ на C++.
2. Аккаунт на [GitHub](https://github.com/). [Инструкция по регистрации на GitHub](https://github.com/netology-code/cppm-homeworks/tree/main/common/sign%20up).
3. Система контроля версий [Git](https://git-scm.com/), установленная локально. [Инструкция по установке Git](https://github.com/netology-code/cppm-homeworks/tree/main/common/download).

### Инструкция по выполнению домашнего задания

[Инструкция дана по ссылке](https://github.com/netology-code/cppm-homeworks/blob/main/common/readme.md).

------

### Задание 1

[Лямда-функции](01).
<details>
# Задача 1. Лямбда-функция

### Описание
Напишите программу, которая все нечётные элементы массива (`std::vector`) умножает на 3 с помощью лямбда-функции.

Циклы использовать не нужно.

### Пример работы программы
```
Входные данные:  4 7 9 14 12 
Выходные данные: 4 21 27 14 12
```
#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Что использовать для решения.</summary>

Подсказка 1. Прочитать про вектор можно [по ссылке](https://ru.cppreference.com/w/cpp/container/vector). Вам понадобятся методы `begin` и `end`.

Подсказка 2. Можно использовать функцию `std::for_each`.

</details>
</details>



### Задание 2

[std::variant](02).

<details>
# Задача 2. std::variant

### Описание
std::variant бывает удобно применять в разработке парсеров.

Например, есть некоторая универсальная функция, которая может возвращать значения разных типов в зависимости от контекста.
В этом задании вам нужно использовать простую функцию, которая может возвращать число, строку или массив чисел. 

```C++
std::variant<int, std::string, std::vector<int>> get_variant() {
	std::srand(std::time(nullptr));
	int random_variable = std::rand() % 3;

	std::variant<int, std::string, std::vector<int>> result;
	switch (random_variable)
	{
	case 0:
		result = 5;
		break;
	case 1:
		result = "string";
		break;
	case 2:
		result = std::vector<int>{ 1, 2, 3, 4, 5 };
		break;
	default:
		break;
	}
	return result;
}
```

Вам нужно написать обработку результата этой функции следующим образом:
* Если в результате функции содержится int, то вывести число, умноженное на 2.
* Если в результате функции содержится строка, то просто вывести её в консоль.
* Если в результате функции содержится вектор чисел, то вывести все его элементы в консоль.


#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Какие функции использовать.</summary>

Используйте функции `std::holds_alternative`, `std::get` или `std::get_if`.

</details>

</details>

### Задание 3*

[Операции над углами](https://github.com/netology-code/cppl-homeworks/tree/main/01/03).
<details>
# Задача 3*. Операции над углами

### Описание
Иногда бывает нужно хранить созданные лямбда-функции. Для этого есть тип [std::function](https://en.cppreference.com/w/cpp/utility/functional/function).

В этой задаче вам дан массив значений углов. Нужно вывести их синус и косинус.
Сделать это нужно так, чтобы при необходимости вывода новых операций с этими углами, например, если захотим посчитать тангенс, не пришлось изменять код вывода.

```C++
for (const auto& angle : angles) {
	std::cout << angle << ": ";
	for (const auto& function : functions)
		function(angle);
	std::cout << std::endl;
}
```

### Пример правильной работы программы
```
[Входные данные]: 30 * 3.1415926 / 180, 60 * 3.1415926 / 180, 90 * 3.1415926 / 180 // перевод из градусов в радианы
[Выходные данные]:
0.523599: sin: 0.5 cos: 0.866025
1.0472: sin: 0.866025 cos: 0.5
1.5708: sin: 1 cos: 2.67949e-08
```


#### Подсказки

Не читайте этот раздел сразу. Попытайтесь сначала решить задачу самостоятельно :)

<details>

<summary>Что использовать для решения.</summary>

Нужно правильно понять, какая сигнатура будет у лямда-функций, и правильно их сохранить.

</details>

</details>
------

### Правила приёма домашней работы

Чтобы сдать домашнее задание, прикрепите в личном кабинете ссылку на ваш репозиторий.

### Критерии оценки домашней работы

1. В личном кабинете прикреплена ссылка на репозиторий с кодом для заданий 1 и 2 (3, если сделали).
2. В ссылке содержится код, который при запуске выполняет описанный в задании алгоритм.




